if __name__ == '__main__':

    '''1. Создать класс тор, в котором будут реализованы конструктор, методы для нахождения площади поверхности и объема
    тела, который ограничивается тором и метод для вывода информации про объект
    '''

    '''2. Создать класс сфера, в котором будут реализованы конструктор, методы для нахождения площади поверхности,
     метод для нахождения объема и метод для вывода информации про объект
    '''

    '''3. Создать класс куб, в котором будут реализованы конструктор, методы для нахождения площади поверхности,
     метод для нахождения объема и метод для вывода информации про объект
    '''

    '''4. Создать класс пирамида, в котором будут реализованы конструктор, методы для нахождения площади поверхности,
     метод для нахождения объема и метод для вывода информации про объект
    '''

    '''5. Создать класс конус, в котором будут реализованы конструктор, методы для нахождения площади поверхности,
     метод для нахождения объема и метод для вывода информации про объект
    '''

    '''6. Создать класс цилиндр, в котором будут реализованы конструктор, методы для нахождения площади поверхности,
     метод для нахождения объема и метод для вывода информации про объект
    '''

    '''7. Создать класс параллелепипед, в котором будут реализованы конструктор, методы для нахождения площади 
    поверхности, метод для нахождения объема и метод для вывода информации про объект
    '''

    '''8. Создать класс призма, в котором будут реализованы конструктор, методы для нахождения площади поверхности,
     метод для нахождения объема и метод для вывода информации про объект
    '''